In [1]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [2]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [3]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df.shape#shape is attribute

(7, 3)

In [7]:
print("rows",df.shape[0])
print("columns",df.shape[1])

rows 7
columns 3

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# Checking for null value

In [9]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [10]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [11]:
df.isnull().sum(axis=1)#columns

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# Overall statistics

In [12]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [13]:
df.describe(include="all")

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Aadhya        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

# unique values in column

In [14]:
df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
df["Gender"].nunique()

2

In [16]:
df["Gender"].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [17]:
df.Marks>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [18]:
df[df.Marks>=90]#shows rows with true value

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [19]:
df[(df.Marks>=60) & (df.Marks<=90)].count()

Name      4
Marks     4
Gender    4
dtype: int64

In [20]:
sum(df.Marks.between(90,100))

4

In [21]:
df.groupby(["Gender"]).sum()

        Marks
Gender
Female    370
Male      275

In [22]:
pd.crosstab(df["Gender"],df["Marks"])

Marks   83  87  89  90  98  99
Gender
Female   1   0   1   0   0   2
Male     0   1   0   1   1   0

In [23]:
df["Marks"].min()

83

In [24]:
df["Marks"].mean()

92.14285714285714

In [25]:
df.groupby("Gender").mean()

            Marks
Gender
Female  92.500000
Male    91.666667

# Apply method (takes maths funct.)

In [26]:
def marks(x):
    return x/2  # //

In [27]:
df["Half_Marks"]=df.Marks.apply(marks)
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [28]:
df.Marks.apply(lambda y:y/2)    # works as an iterator

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [29]:
df.Name.apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# Map function
### - leaves value that not iterable

In [30]:
df["Male_Female"]=df["Gender"].map({"Male":1,"Female":0})
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [31]:
df=df.drop(["Male_Female","Half_Marks"],axis=1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [32]:
df.sort_values("Marks")

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [33]:
df.sort_values(["Marks","Gender"],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

# Selection

In [34]:
df[df.Gender=="Female"][["Name","Marks"]]#2d list

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [35]:
df[df.Gender.isin (["Female"])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [36]:
df[df.Gender.isin (["Female"])][["Name","Marks"]]#2d list

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99